<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Content;

class ContentSeeder extends Seeder
{
    public function run(): void
    {
        // วิสัยทัศน์
        $vision = Content::create([
            'slug' => 'vision',
            'type' => 'about'
        ]);
        $vision->translations()->create([
            'lang' => 'th',
            'title' => 'วิสัยทัศน์',
            'body' => 'เครือข่ายสุขภาพที่เป็นเลิศด้านการสาธารณสุขทางทะเล ด้วยเทคโนโลยีในการบริการสุขภาพตามมาตรฐานสากล ประชาชนและนักท่องเที่ยวมีสุขภาวะที่ดี พึ่งตนเองได้'
        ]);

        // พันธกิจ
        $mission = Content::create([
            'slug' => 'mission',
            'type' => 'about'
        ]);
        $mission->translations()->create([
            'lang' => 'th',
            'title' => 'พันธกิจ',
            'body' => 'กรอบในการดำเนินงานตามภารกิจของการสาธารณสุขทางทะเลและภารกิจการพัฒนาไปสู่วิสัยทัศน์ ยุทธศาสตร์ได้กำหนดพันธกิจ ดังนี้ 1) ส่งเสริมสุขภาพ ควบคุมและป้องกันโรค รักษาโรค และฟื้นฟูสุขภาพแก่ประชาชนในพื้นที่ ด้วยมาตรฐานการจัดบริการสุขภาพที่มีคุณภาพ 2) บูรณาการและระดมพลังภาคีทุกภาคส่วนเพื่อร่วมเสริมสร้างอำเภอเกาะช้างให้เป็นเมืองสุขภาวะ ที่มีสภาพแวดล้อมเอื้อต่อการส่งเสริมสุขภาพ เสริมสร้าง ความฉลาดรู้ทางสุขภาพแก่ประชาชน ชุมชนให้มีความเข้มแข็งในการจัดการสุขภาพที่สามารถพึ่งตนเองได้อย่างเท่าทัน ตามบริบทของพื้นที่ และความเปลี่ยนแปลง 3) เสริมสร้างขีดความสามารถของระบบบริการสุขภาพ สถานบริการสุขภาพ บุคลากรทางสุขภาพ เครือข่ายการบริการสุขภาพของอำเภอ ให้มีสมรรถนะสูงในการให้บริการสุขภาพ อย่างมีมาตรฐานสากล ในการพัฒนาการสาธารณสุขทางทะเล การสาธารณสุขชายแดน และการสาธารณสุขของพื้นที่เศรษฐกิจพิเศษ 4) เสริมสร้างความเข้มแข็งของโรงพยาบาล โรงพยาบาลส่งเสริมสุขภาพ ด้านการบริหารจัดการ บุคลากร การเงินการคลังที่พึ่งตนเองได้สูง การมีธรรมภิบาล และการเป็นองค์กรแห่งการเรียนรู้ที่มีความทันสมัย'
        ]);

        // ค่านิยม
        $values = Content::create([
            'slug' => 'values',
            'type' => 'about'
        ]);
        $values->translations()->create([
            'lang' => 'th',
            'title' => 'ค่านิยม',
            'body' => 'ว่องไว ให้คุณค่ากับบุคลากร มีความคิดสร้างสรรค์'
        ]);

        // ประวัติอำเภอเกาะช้าง
        $districtHistory = Content::create([
            'slug' => 'district-history',
            'type' => 'history'
        ]);
        $districtHistory->translations()->create([
            'lang' => 'th',
            'title' => 'ประวัติอำเภอเกาะช้าง',
            'body' => 'อำเภอเกาะช้างมีประวัติอันยาวนาน เท่าที่มีหลักฐาน นับตั้งแต่ครั้งกรุงศรีอยุทธยา มีเรือสำเภาจากเมืองจีนเดินทางเข้ามาค้าขายผ่านเมืองญวณ เมืองเขมร เมืองเกาะกง (ซึ่งแต่เดิมเป็นของสยาม) และเข้ามาถึงเมืองตราด ในช่วงมรสุม(พฤษภาคม-ตุลาคม) เรือสำเภาจะเข้ามาพักหลบคลื่นลมตามหมู่เกาะช้าง บริเวณบ้านด่าน บ้านคลองสน อ่าวสลักเพชร และอ่าวบางเบ้า เชื่อว่าชาวจีนที่มากับเรือสำเภาจะเป็นกลุ่มแรกที่มาอาศัยตั้งถิ่นฐานทำมาหากิน'
        ]);

        // ประวัติอำเภอเกาะช้าง
        $districtestablishment = Content::create([
            'slug' => 'district-establishment',
            'type' => 'history'
        ]);
        $districtestablishment->translations()->create([
            'lang' => 'th',
            'title' => 'จัดตั้งอำเภอเกาะช้าง',
            'body' => 'พ.ศ. 2440 ได้จัดตั้งอำเภอขึ้นใช้ชื่อว่า อำเภอเกาะช้าง ตั้งอยู่ที่บ้านด่าน ตำบลเกาะช้าง พื้นที่ของอำเภอในสมัยนั้น รวมถึงอำเภอแหลมงอบ เกาะกูด และเกาะต่างๆ รวม 52 เกาะ สาเหตุที่ตั้งบ้านด่านเพราะเป็นแหล่งรวมของการค้าขาย เรือสำเภาจีนจะนำสินค้าจากเมืองจีนเข้ามาขายและส่วนหนึ่งจะแล่นต่อไปกรุงเทพฯ ขากลับจะแวะพักที่บ้านด่านอีก เมื่อเรือสำเภาจากเมืองจีนเข้ามาจอด จะมีผู้คนจากแหลมงอบนั่งเรือใบ หรือเรือแจวมาซื้อสินค้า และเมื่อเรือสำเภาจีนเดินทางมาจากกรุงเทพฯ คนจากฝั่งแหลมงอบจะนำสินค้าทางการเกษตรมาขายให้เรือสำเภาจีนนำกลับไปขายที่เมืองจีน ในปี พ.ศ.2450 เรือสำเภาจีนเดินทางเข้ามาค้าขายน้อยลง เนื่องจากอิทธิพลของฝรั่งเศสที่เข้ามาล่าเมืองขึ้น โดยยึดคลองเมืองญวณ เมืองเขมร และส่วนหนึ่งของเมืองสยาม ประชาชนจากตำบลแหลมงอบจึงไม่ค่อยได้เดินทางมาถึง อำเภอเกาะช้าง ประกอบกับการมาติดต่อราชการที่อำเภอเกาะช้างไปตั้งอยู่ที่ฝั่งตำบลแหลมงอบและยังใช้ชื่อว่าอำเภอเกาะช้างอยู่ พ.ศ. 2482 ทางราชการจึงเปลี่ยนชื่ออำเภอใหม่ ตามสถานที่ตั้งเป็นอำเภอแหลมงอบจนถึงปัจจุบัน เกาะช้างเป้นเพียงตำบลหนึ่งขึ้นกับอำเภอแหลมงอบ ตั้งแต่นั้นมา พ.ศ.2537 กระทรวงมหาดไทยได้ประกาศจัดตั้งกิ่งอำเภอเกาะช้างขึ้นอีก เมื่อวันที่ 30 เมษายน 2537 เนื่องจากอำเภอเกาะช้างมีธรรมชาติสวยงาม และมีนักท่องเที่ยวจำนวนมาก พ.ศ. 2550 กิ่งอำเภอเกาะช้าง ได้ยกฐานะเป็นอำเภอเกาะช้าง ตามพระราชกฤษฎีกาตั้งอำเภอฯ ประกาศในราชกิจจานุเบกษา ฉบับกฤษฎีกา เล่ม 124 ตอนที่ 46 ก ลงวันที่ 24 สิงหาคม 2550 มีผลเป็นฐานะอำเภอ ในวันที่ 8 กันยายน 2550 ซึ่งเป็นโครงการอำเภอเฉลิมพระเกียรติ พระบาทสมเด็จพระเจ้าอยู่หัว เนื่องในโอกาสมหามงคลเฉลิมพระชนมพรรษา 5 ธันวาคม 2550'
        ]);

        // ประวัติโรงพยาบาลเกาะช้าง
        $hospitalHistory = Content::create([
            'slug' => 'hospital-history',
            'type' => 'history'
        ]);
        $hospitalHistory->translations()->create([
            'lang' => 'th',
            'title' => 'ประวัติโรงพยาบาลเกาะช้าง',
            'body' => 'โรงพยาบาลเกาะช้างได้รับบริจาคที่ดินจากนายสนิท-นางดารา เยาวรัตน์ จำนวน 6 ไร่ 2 งาน 39 ตารางวา และนายประกอบ-นางวิไลวรรณ ครุพานิช จำนวน 3 ไร่ 2 งาน 11 ตารางวา เมื่อวันที่ 29 ตุลาคม 2542 และได้จัดพิธีวางศิลาฤกษ์ขึ้นเมื่อวันที่ 24 ธันวาคม 2539 โดยนายแพทย์จำรูญ มีขนอน รองปลัดกระทรวงสาธารณสุข ได้รับงบประมาณในการก่อสร้าง จำนวน 21 ล้านบาท เริ่มดำเนินการก่อสร้างเมื่อวันที่ 1 ตุลาคม 2540 ก่อสร้างแล้วเสร็จเมื่อวันที่ 26 มีนาคม 2542'
        ]);
    }
}
